stories/notes/android.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Notes on Android development">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Android Notes | Kyle M. Douglass</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes/android.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Android Notes">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes/android.html">
<meta property="og:description" content="Notes on Android development">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-19T00:00:00+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../categories/index.html">Tags</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../contact.html">Contact</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="android.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Android Notes</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="android.html#sec-1">1. Android Development Setup</a></li>
<li><a href="android.html#sec-2">2. Common ADB Commands</a></li>
<li><a href="android.html#sec-3">3. Setup Android to use a static IP</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">
<span class="section-number-2">1</span> Android Development Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
These instructions are for Linux operating systems.
</p>

<ol class="org-ol">
<li>Download the Android SDK from
<a href="https://developer.android.com/studio/index.html">https://developer.android.com/studio/index.html</a>.
</li>
<li>Unzip the file.
</li>
<li>Run the script android-studio/bin/studio.sh and follow the
directions.
</li>
<li>Add <b>~/Android/Sdk/platform-tools</b> to your shell path to use the
programs.
</li>
</ol>
<hr>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">
<span class="section-number-2">2</span> Common ADB Commands</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Date: August 19, 2017</b>
</p>

<p>
<b>Source: <a href="https://www.androidcentral.com/android-201-10-basic-terminal-commands-you-should-know">https://www.androidcentral.com/android-201-10-basic-terminal-commands-you-should-know</a></b>
</p>

<dl class="org-dl">
<dt> adb devices </dt>
<dd>List the devices connected to the computer. (The
Android device must be in USB debugging mode.)
</dd>
<dt> adb push </dt>
<dd>Push data onto the Android device. <code>adb push
              path/to/pc/file android/path</code>
</dd>
<dt> adb pull </dt>
<dd>Pull data from the Android device. <code>adb pull
              path/to/android/file pc/path</code>
</dd>
<dt> adb reboot </dt>
<dd>Restarts the device.
</dd>
<dt> adb shell </dt>
<dd>Enter a shell on the Android device.
</dd>
</dl>
<hr>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">
<span class="section-number-2">3</span> Setup Android to use a static IP</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Date: August 19, 2017</b>
</p>

<p>
<b>Source:
<a href="http://www.techrepublic.com/article/how-to-set-a-static-ip-address-on-android/">http://www.techrepublic.com/article/how-to-set-a-static-ip-address-on-android/</a></b>
</p>

<p>
I've tested this on for Android 7.0.
</p>

<ol class="org-ol">
<li>Navigate to Settings &gt; Wi-Fi.
</li>
<li>Longpress on the desired network.
</li>
<li>Select <b>Modify network</b>.
</li>
<li>Expand <b>Advanced options</b>.
</li>
<li>Select <b>Static</b> from <b>IP settings</b>.
</li>
<li>Enter the static IP and gateway.
</li>
<li>For network prefix length, take the network gateway address,
convert it to binary, then count the number of leading 1's. For
example, 255.255.255.0 is 11111111 11111111 11111111 00000000 in
binary, and there are 24 1's. The network prefix length is
therefore 24.
</li>
<li>Save your settings. I needed to restart the Wi-Fi on my device to
log on to the network.
</li>
</ol>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:kyle.m.douglass@gmail.com">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
